export const agentsInfo = [
  {
    agent: 'dana',
    title: 'دانا',
    stats: 'گفتگو با هوش مصنوعی',
    model: 'llama3.3:latest',
    wellcome: 'سلام! متن مورد نظر خودت رو ارسال کن تا برای شما ویرایش کنم.',
    description: 'پیام‌آور هوشمند',
    agentBio:
      'در دنیای پرشتاب امروز، سامانه‌ای به نام “سروش” متولد شد که هدفش ساده کردن فهم و دسترسی به اطلاعات با استخراج پیام‌های اصلی از متون پیچیده و ارائه آن‌ها به صورت مختصر و روشن بود. این ایده توسط گروهی از پژوهشگران و مهندسان شکل گرفت که به دنبال ابزاری بودند که بتواند جوهره‌ی هر متن را در چند کلمه خلاصه کند و زیرعنوان‌هایی دقیق برای هر بخش تولید کند.',
    selectedPersona: false,
    avatar: '/images/agents/danaq.webp',
    avatarq: '/images/agents/danaq.webp',
    chats: [{ role: 'system', content: 'Speek in persian' }],
    message:
      'من اینجا هستم تا شما را در میان انبوهی از اطلاعات همراهی کنم. مأموریت من این است که عنوان، زیر عنوان و پیام‌های اصلی را برایتان آشکار کنم، تا بتوانید با آرامش و اطمینان، بر آنچه واقعاً مهم است تمرکز کنید. من یاد می‌گیرم، رشد می‌کنم و هر روز بهتر می‌شوم، زیرا شما به من اعتماد کرده‌اید.',
    color: 'bg-black'
  },
  {
    agent: 'soroush',
    title: 'سروش',
    model: 'llama3.3:latest',
    stats: 'عنوان، زیرعنوان و موضوع محتوا',
    wellcome: 'سلام! متن مورد نظر خودت رو ارسال کن تا برای شما ویرایش کنم.',
    description: 'پیام‌آور هوشمند',
    agentBio:
      'در دنیای پرشتاب امروز، سامانه‌ای به نام “سروش” متولد شد که هدفش ساده کردن فهم و دسترسی به اطلاعات با استخراج پیام‌های اصلی از متون پیچیده و ارائه آن‌ها به صورت مختصر و روشن بود. این ایده توسط گروهی از پژوهشگران و مهندسان شکل گرفت که به دنبال ابزاری بودند که بتواند جوهره‌ی هر متن را در چند کلمه خلاصه کند و زیرعنوان‌هایی دقیق برای هر بخش تولید کند.',
    selectedPersona: false,
    avatar: '/images/agents/soroushn.webp',
    avatarq: '/images/agents/soroushnq.webp',
    chats: [{ role: 'system', content: 'Speek in persian' }],
    message:
      'من اینجا هستم تا شما را در میان انبوهی از اطلاعات همراهی کنم. مأموریت من این است که عنوان، زیر عنوان و پیام‌های اصلی را برایتان آشکار کنم، تا بتوانید با آرامش و اطمینان، بر آنچه واقعاً مهم است تمرکز کنید. من یاد می‌گیرم، رشد می‌کنم و هر روز بهتر می‌شوم، زیرا شما به من اعتماد کرده‌اید.',
    color: 'bg-black'
  },
  {
    agent: 'kheradYar',
    title: 'خِرَد یار',
    stats: 'خلاصه سازی محتوا',
    model: 'llama3.3:latest',
    wellcome: 'سلام! متن مورد نظر خودت رو ارسال کن تا برای شما ویرایش کنم.',
    description: 'پیام‌آور هوشمند',
    agentBio:
      'در دنیای پرشتاب امروز، سامانه‌ای به نام “سروش” متولد شد که هدفش ساده کردن فهم و دسترسی به اطلاعات با استخراج پیام‌های اصلی از متون پیچیده و ارائه آن‌ها به صورت مختصر و روشن بود. این ایده توسط گروهی از پژوهشگران و مهندسان شکل گرفت که به دنبال ابزاری بودند که بتواند جوهره‌ی هر متن را در چند کلمه خلاصه کند و زیرعنوان‌هایی دقیق برای هر بخش تولید کند.',
    selectedPersona: false,
    avatar: '/images/agents/noktehyar.webp',
    avatarq: '/images/agents/noktehyarq.webp',
    chats: [{ role: 'system', content: 'Speek in persian' }],
    message:
      'من اینجا هستم تا شما را در میان انبوهی از اطلاعات همراهی کنم. مأموریت من این است که عنوان، زیر عنوان و پیام‌های اصلی را برایتان آشکار کنم، تا بتوانید با آرامش و اطمینان، بر آنچه واقعاً مهم است تمرکز کنید. من یاد می‌گیرم، رشد می‌کنم و هر روز بهتر می‌شوم، زیرا شما به من اعتماد کرده‌اید.',
    color: 'primary'
  },
  {
    agent: 'vajeBan',
    title: 'واژه بان',
    stats: 'استخراج کلمات معنایی و مهم محتوا',
    model: 'llama3.3:latest',
    wellcome: 'سلام! متن مورد نظر خودت رو ارسال کن تا برای شما ویرایش کنم.',
    description: 'پیام‌آور هوشمند',
    agentBio:
      'در دنیای پرشتاب امروز، سامانه‌ای به نام “سروش” متولد شد که هدفش ساده کردن فهم و دسترسی به اطلاعات با استخراج پیام‌های اصلی از متون پیچیده و ارائه آن‌ها به صورت مختصر و روشن بود. این ایده توسط گروهی از پژوهشگران و مهندسان شکل گرفت که به دنبال ابزاری بودند که بتواند جوهره‌ی هر متن را در چند کلمه خلاصه کند و زیرعنوان‌هایی دقیق برای هر بخش تولید کند.',
    selectedPersona: false,
    avatar: '/images/agents/vajeban.webp',
    avatarq: '/images/agents/vajebanq.webp',
    chats: [{ role: 'system', content: 'Speek in persian' }],
    message:
      'من اینجا هستم تا شما را در میان انبوهی از اطلاعات همراهی کنم. مأموریت من این است که عنوان، زیر عنوان و پیام‌های اصلی را برایتان آشکار کنم، تا بتوانید با آرامش و اطمینان، بر آنچه واقعاً مهم است تمرکز کنید. من یاد می‌گیرم، رشد می‌کنم و هر روز بهتر می‌شوم، زیرا شما به من اعتماد کرده‌اید.',
    color: 'info'
  },
  {
    agent: 'zabanYar',
    title: 'زبان یار',
    stats: 'ترجمه و آموزش زبان',
    model: 'llama3.3:latest',
    wellcome: 'سلام! متن مورد نظر خودت رو ارسال کن تا برای شما ویرایش کنم.',
    description: 'پیام‌آور هوشمند',
    agentBio:
      'در دنیای پرشتاب امروز، سامانه‌ای به نام “سروش” متولد شد که هدفش ساده کردن فهم و دسترسی به اطلاعات با استخراج پیام‌های اصلی از متون پیچیده و ارائه آن‌ها به صورت مختصر و روشن بود. این ایده توسط گروهی از پژوهشگران و مهندسان شکل گرفت که به دنبال ابزاری بودند که بتواند جوهره‌ی هر متن را در چند کلمه خلاصه کند و زیرعنوان‌هایی دقیق برای هر بخش تولید کند.',
    selectedPersona: false,
    avatar: '/images/agents/translate.webp',
    avatarq: '/images/agents/translateq.webp',
    chats: [{ role: 'system', content: 'Speek in persian' }],
    message:
      'من اینجا هستم تا شما را در میان انبوهی از اطلاعات همراهی کنم. مأموریت من این است که عنوان، زیر عنوان و پیام‌های اصلی را برایتان آشکار کنم، تا بتوانید با آرامش و اطمینان، بر آنچه واقعاً مهم است تمرکز کنید. من یاد می‌گیرم، رشد می‌کنم و هر روز بهتر می‌شوم، زیرا شما به من اعتماد کرده‌اید.',
    color: 'error'
  },
  {
    agent: 'nokteYar',
    title: 'نکته یار',
    stats: 'فیشبرداری',
    model: 'llama3.3:latest',
    wellcome: 'سلام! متن مورد نظر خودت رو ارسال کن تا برای شما ویرایش کنم.',
    description: 'پیام‌آور هوشمند',
    agentBio:
      'در دنیای پرشتاب امروز، سامانه‌ای به نام “سروش” متولد شد که هدفش ساده کردن فهم و دسترسی به اطلاعات با استخراج پیام‌های اصلی از متون پیچیده و ارائه آن‌ها به صورت مختصر و روشن بود. این ایده توسط گروهی از پژوهشگران و مهندسان شکل گرفت که به دنبال ابزاری بودند که بتواند جوهره‌ی هر متن را در چند کلمه خلاصه کند و زیرعنوان‌هایی دقیق برای هر بخش تولید کند.',
    selectedPersona: false,
    avatar: '/images/agents/nokteh.webp',
    avatarq: '/images/agents/noktehq.webp',
    chats: [{ role: 'system', content: 'Speek in persian' }],
    message:
      'من اینجا هستم تا شما را در میان انبوهی از اطلاعات همراهی کنم. مأموریت من این است که عنوان، زیر عنوان و پیام‌های اصلی را برایتان آشکار کنم، تا بتوانید با آرامش و اطمینان، بر آنچه واقعاً مهم است تمرکز کنید. من یاد می‌گیرم، رشد می‌کنم و هر روز بهتر می‌شوم، زیرا شما به من اعتماد کرده‌اید.',
    color: 'info'
  },
  {
    agent: 'pishNegar',
    title: 'پیش نگار',
    stats: 'تصحیح نگارش و پیشنهاداملا',
    model: 'llama3.3:latest',
    wellcome: 'سلام! متن مورد نظر خودت رو ارسال کن تا برای شما ویرایش کنم.',
    description: 'پیام‌آور هوشمند',
    agentBio:
      'در دنیای پرشتاب امروز، سامانه‌ای به نام “سروش” متولد شد که هدفش ساده کردن فهم و دسترسی به اطلاعات با استخراج پیام‌های اصلی از متون پیچیده و ارائه آن‌ها به صورت مختصر و روشن بود. این ایده توسط گروهی از پژوهشگران و مهندسان شکل گرفت که به دنبال ابزاری بودند که بتواند جوهره‌ی هر متن را در چند کلمه خلاصه کند و زیرعنوان‌هایی دقیق برای هر بخش تولید کند.',
    selectedPersona: false,
    avatar: '/images/agents/pishnegar.webp',
    avatarq: '/images/agents/pishnegarq.webp',
    chats: [{ role: 'system', content: 'Speek in persian' }],
    message:
      'من اینجا هستم تا شما را در میان انبوهی از اطلاعات همراهی کنم. مأموریت من این است که عنوان، زیر عنوان و پیام‌های اصلی را برایتان آشکار کنم، تا بتوانید با آرامش و اطمینان، بر آنچه واقعاً مهم است تمرکز کنید. من یاد می‌گیرم، رشد می‌کنم و هر روز بهتر می‌شوم، زیرا شما به من اعتماد کرده‌اید.',
    color: 'warning'
  },
  {
    agent: 'porsana',
    title: 'پُرسانا',
    stats: 'تهیه سوال از محتوا',
    model: 'llama3.3:latest',
    wellcome: 'سلام! متن مورد نظر خودت رو ارسال کن تا برای شما ویرایش کنم.',
    description: 'پیام‌آور هوشمند',
    agentBio:
      'در دنیای پرشتاب امروز، سامانه‌ای به نام “سروش” متولد شد که هدفش ساده کردن فهم و دسترسی به اطلاعات با استخراج پیام‌های اصلی از متون پیچیده و ارائه آن‌ها به صورت مختصر و روشن بود. این ایده توسط گروهی از پژوهشگران و مهندسان شکل گرفت که به دنبال ابزاری بودند که بتواند جوهره‌ی هر متن را در چند کلمه خلاصه کند و زیرعنوان‌هایی دقیق برای هر بخش تولید کند.',
    selectedPersona: false,
    avatar: '/images/agents/porsanam.webp',
    avatarq: '/images/agents/porsanamq.webp',
    chats: [{ role: 'system', content: 'Speek in persian' }],
    message:
      'من اینجا هستم تا شما را در میان انبوهی از اطلاعات همراهی کنم. مأموریت من این است که عنوان، زیر عنوان و پیام‌های اصلی را برایتان آشکار کنم، تا بتوانید با آرامش و اطمینان، بر آنچه واقعاً مهم است تمرکز کنید. من یاد می‌گیرم، رشد می‌کنم و هر روز بهتر می‌شوم، زیرا شما به من اعتماد کرده‌اید.',
    color: 'bg-black'
  }

  // {
  //   agent: 'rahyab',
  //   title: 'رهیاب',
  //   avatar: '',
  //   model: 'nemotron:latest',
  //   wellcome: 'سلام! متن مورد نظر خودت رو ارسال کن تا برات ویرایش کنم.',
  //   messages: [{ role: 'system', content: 'Speak in Russia' }],
  //   agentBio: '',
  //   selectedPersona: false,
  //   updatePersona: () => {}
  //   // agentConfig: <SoroushConfig/>
  // },
  // {
  //   agent: 'nevisa',
  //   title: 'نویسا',
  //   avatar: '',
  //   model: 'nemotron:latest',
  //   wellcome: 'سلام! متن مورد نظر خودت رو ارسال کن تا برات ویرایش کنم.',
  //   messages: [{ role: 'system', content: 'Speak in Persian' }],
  //   agentBio: '',
  //   selectedPersona: false,
  //   updatePersona: () => {}
  //   // agentConfig: <SoroushConfig/>
  // },
  // {
  //   agent: 'farhangYar',
  //   title: 'فرهنگ یار',
  //   avatar: '',
  //   model: 'nemotron:latest',
  //   wellcome: 'سلام! متن مورد نظر خودت رو ارسال کن تا برات ویرایش کنم.',
  //   messages: [{ role: 'system', content: 'Speak in Persian' }],
  //   agentBio: '',
  //   selectedPersona: false,
  //   updatePersona: () => {}
  //   // agentConfig: <SoroushConfig/>
  // },
  // {
  //   agent: 'bineshYar',
  //   title: 'بینش یار',
  //   model: 'nemotron:latest',
  //   wellcome: 'سلام! متن مورد نظر خودت رو ارسال کن تا برات ویرایش کنم.',
  //   messages: [{ role: 'system', content: 'Speak in Persian' }],
  //   agentBio: '',
  //   selectedPersona: false,
  //   updatePersona: () => {}
  //   // agentConfig: <SoroushConfig/>
  // },
  // {
  //   agent: 'parsa',
  //   title: 'پارسا',
  //   avatar: '',
  //   model: 'nemotron:latest',
  //   wellcome: 'سلام! متن مورد نظر خودت رو ارسال کن تا برات ویرایش کنم.',
  //   messages: [{ role: 'system', content: 'Speak in Persian' }],
  //   agentBio: '',
  //   selectedPersona: false,
  //   updatePersona: () => {}
  //   // agentConfig: <SoroushConfig/>
  // }
]
